# Q.1
# 첫 번째 항의 값이 0이고 두 번째 항의 값이 1일 때, 이후에 이어지는 항들은 이전의 두항을 더한
# 값으로 이루어지는 수열을 피보나치 수열이라고 한다.
# 0, 1, 1, 2, 3, 5, 8, 13...
#
# 입력을 정수 n으로 받았을 때, n 이하 까지의 피보나치 수열을 출력하는 함수를 작성해 보자.
# def fib(n):
#   if              # n이 0일 때는 0을 리턴
#   if              # n이 1일 때는 1을 리턴
#   return          # n이 2이상일 때는 그 이전의 두 값을 더하여 리턴
#
#
#
# Q.2
# 오른쪽과 같이 총 10줄로 이루어진 sample.txt 파일이 있다.
# 다음 쪽을 보며, sample.txt 파일의 숫자값을 모두 읽어 총합과 평균값을 구한 후
# 평균값을 result.txt라는 파일에 쓴느 프로그램을 작성해보자.
# 70
# 60
# 55
# 75
# 95
# 90
# 80
# 80
# 85
# 100
# f = open("sample.txt")
# linex =                # sample.txt를 줄 단위로 모두 읽는다.
# f.close()
#
# total = 0
# for line in lines:
#   score =             # 줄에 적힌 점수를 숫자형으로 변환한다.
#   total +=
#
# average =
#
# f = open("result.txt",            )
# f.
# f.close()
#
#
#
#
#
#
#
#
#
#
#
#
#
# sd