# Q.1
# 홍길동씨의 주민등록번호는 881120-1068234이다.
# 홍길동씨의 주민등록번호를 연월일(YYYYMMDD) 부분과 그 뒤의 숫자 부분으로 나누어 출력해 보자.
#
# pin = "881120-1068234"
# yyyymmdd =
# num =
# print(             ) # 연월일 부분 출력
# print(             ) # 숫자 부분 출력
#
# 결과값
# 881120
# 1068234
#
#
#
# Q.2
# 주민등록번호 뒷자리의 맨 첫 번째 숫자는 성별을 나타낸다.
# 주민등록번호에서 성별을 나타내는 숫자를 출력해 보자.
#
# pin = "881120-1068234"
# print(             )
#
# 결과값
# 1
#
#
#
# Q.3
# [1, 3, 5, 4, 2]라는 리스트를 [5, 4, 3, 2, 1]로 만들어보자.
# a = [1, 3, 5, 4, 2]
# a.                    # [1, 2, 3, 4, 5]로 변경
# a.                    # [5, 4, 3, 2, 1]로 변경
# print(              )
#
# 결과값
# [5, 4, 3, 2, 1]
#
#
#
# Q.4
# ['Life', 'is', 'too', 'short']라는 리스트를 Life is too short라는 문자열로 만들어 출력해 보자.
# a = ['Life', 'is', 'too', 'short']
# result =
# print(                )
#
# 결과값
# Life is too short
#
#
#
# Q.5
# (1, 2, 3)이라는 튜플에 4라는 값을 추가하여 (1, 2, 3, 4)처럼 만들어 출력해보자.
# a = (1, 2, 3)
# a = (             )
# print (           )
#
# 결과값
# (1, 2, 3, 4)
#
#
#
# Q.6
# 딕셔너리 a에서 'B'에 해당되는 값을 추출하고 삭제해 보자.
# a = {'A':90, 'B':80, 'C':70}
# result =   
# print(                )   # B를 추출한 후 딕셔너리
# print(                )   # B에 해당되는 값
#
# 결과값
# {'A':90, 'C':70}
# 80
#
#
#
# Q.7
# a 리스트에서 중복된 숫자들을 제거해 보자.
# a = [1, 1, 1, 2, 2, 3, 3, 3, 4, 4, 5]
# aSet =
# b =
# print(                )
#
# 결과값
# [1, 2, 3, 4, 5]
#
#
#
# Q.8 파이썬은 다음처럼 동일한 값에 여러 개의 변수를 선언할 수 있다.
# 아래와 같이 a, b 변수를 선언한 후 a의 첫 번째 요소값을 변경하면 b의 값은 어떻게 될까?
# 그리고 이런 결과가 나오는 이유에 대해서 설명해보자.
#
# >>> a = b = [1, 2, 3]
# >>> a[1] = 4
# >>> print(b)
#
#
#




















