# Q.1
# 홍길동씨의 주민등록번호는 881120-1068234이다.
# 홍길동씨의 주민등록번호를 연월일(YYYYMMDD) 부분과 그 뒤의 숫자 부분으로 나누어 출력해 보자.
#
# pin = "881120-1068234"
# yyyymmdd =
# num =
# print(             ) # 연월일 부분 출력
# print(             ) # 숫자 부분 출력
#
# 결과값
# 881120
# 1068234
#
#
#
# Q.2
# 주민등록번호 뒷자리의 맨 첫 번째 숫자는 성별을 나타낸다.
# 주민등록번호에서 성별을 나타내는 숫자를 출력해 보자.
#
# pin = "881120-1068234"
# print(             )
#
# 결과값
# 1
#
#
#
# Q.3
# [1, 3, 5, 4, 2]라는 리스트를 [5, 4, 3, 2, 1]로 만들어보자.
# a = [1, 3, 5, 4, 2]
# a.                    # [1, 2, 3, 4, 5]로 변경
# a.                    # [5, 4, 3, 2, 1]로 변경
# print(              )
#
# 결과값
# [5, 4, 3, 2, 1]
#
#
#
# Q.4
# ['Life', 'is', 'too', 'short']라는 리스트를 Life is too short라는 문자열로 만들어 출력해 보자.
# a = ['Life', 'is', 'too', 'short']
# result =
# print(                )
#
# 결과값
# Life is too short
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#




















